## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/15019771468)



<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * google_secret_manager_secret_iam_member.artifact_registry_access
  * module.dockerhub_mirror.google_artifact_registry_repository.unprotected_repository[0]
  * module.dockerhub_mirror.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com"]



<details><summary>Change Result (Click me)</summary>

```hcl

  # google_secret_manager_secret_iam_member.artifact_registry_access will be created
  + resource "google_secret_manager_secret_iam_member" "artifact_registry_access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:azure-pipeline-image-builder@kyma-project.iam.gserviceaccount.com"
      + project   = "sap-kyma-prow"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "docker_sap_org_service_auth_token"
    }

  # module.dockerhub_mirror.google_artifact_registry_repository.unprotected_repository[0] will be created
  + resource "google_artifact_registry_repository" "unprotected_repository" {
      + cleanup_policy_dry_run = true
      + create_time            = (known after apply)
      + description            = "Remote repository mirroring Docker Hub. For more details, see https://github.tools.sap/kyma/oci-image-builder/blob/main/README.md"
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "dockerhub-mirror"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + labels                 = {
          + "name"  = "dockerhub-mirror"
          + "owner" = "neighbors"
          + "type"  = "development"
        }
      + location               = "europe"
      + mode                   = "REMOTE_REPOSITORY"
      + name                   = (known after apply)
      + project                = "kyma-project"
      + repository_id          = "dockerhub-mirror"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "dockerhub-mirror"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + update_time            = (known after apply)

      + docker_config {
          + immutable_tags = false
        }

      + remote_repository_config {
          + description = "Remote repository mirroring Docker Hub"

          + docker_repository {
              + public_repository = "DOCKER_HUB"
            }

          + upstream_credentials {
              + username_password_credentials {
                  + password_secret_version = "projects/351981214969/secrets/docker_sap_org_service_auth_token/versions/1"
                  + username                = "sapcom"
                }
            }
        }
    }

  # module.dockerhub_mirror.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com"] will be created
  + resource "google_artifact_registry_repository_iam_member" "service_account_repoAdmin_access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "serviceAccount:kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com"
      + project    = "kyma-project"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.repoAdmin"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.dev_docker_repository.google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/dev"
        name                   = "dev"
      ~ update_time            = "2025-05-14T10:48:48.600057Z" -> "2025-05-14T11:40:13.538449Z"
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.prod_docker_repository.google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/prod"
        name                   = "prod"
      ~ update_time            = "2025-05-14T10:51:23.763387Z" -> "2025-05-14T11:38:35.003226Z"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>







<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":13051,"Program":"tfcmt","SHA1":"8b0aa10768d577ace82e7883b363d91e50663377","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->